const app = getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    nickName: '',
    avatarUrl: '',
    class1: ["经济学", "法学", "理学", "工学", "管理学", "艺术学", "哲学", "历史学", "基地班实验班", "文学", "教育类"],
    list: [{ "基地班实验班": ["工科试验班类", "人文科学试验班类"]},{"文学": ["中国语言文学类", "新闻传播学类", "外国语言文学类"]},{ "艺术学": ["设计学类", "美术学类", "音乐与舞蹈学类", "戏剧与影视学类"]},{ "工学": ["材料类", "自动化类", "土木类", "机械类", "电子信息类", "建筑类", "仪器类", "计算机类", "能源动力类", "环境科学与工程类", "生物医学工程类", "力学类", "药学类", "基础医学类", "临床医学类", "护理学类", "口腔医学类", "交通运输类", "电气类", "海洋工程类", "食品科学与工程类", "生物工程类", "测绘类", "地质类", "水利类", "核工程类", "林学类", "林业工程类", "中医学类", "纺织类", "水产类", "动物医学类", "化工与制药类", "安全科学与工程类", "航空工程类", "医学技术类", "法医学类", "轻工类", "动物生产类", "植物生产类", "中西医结合类", "农业工程类", "兵器类", "矿业类"], "法学": ["法学类", "社会学类", "政治学类", "民族学类", "马克思主义理论类"]},{ "经济学": ["金融学类", "经济与贸易类", "经济学类", "财政学类"]}, {"理学": ["物理学类", "化学类", "数学类", "统计学类", "天文学类", "地质学类", "地理科学类", "大气科学类", "心理学类", "生物科学类", "海洋科学类"]},{ "哲学": ["哲学类"]},{ "历史学": ["历史学类"]},{ "教育类": ["教育学类", "体育学类"]}, {"管理学": ["工商管理类", "旅游管理类", "电子商务类", "工业工程类", "管理科学与工程类", "公共管理类", "物流管理与工程类", "农业经济管理类"] }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    // wx.request({
    //   url: 'http://139.198.17.207:8092/collage/e6f3ad53011a2f852cf41d3d246d45a1/2bfc4090465fe95f867b2011b5a32f61/1d8f636b03480e902afc4866f5eb8879/AllCeshi',
    //   method:'GET',
    //   success(res){
    //     console.log(res)
    //   }
    // })
    // this.setData({
    //   nickName: app.globalData.userInfo.nickName,
    //   avatarUrl: app.globalData.userInfo.avatarUrl
    // })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})